{"id":1,"name":"FIFA 20","description":"Powered by Frostbite™*, EA SPORTS™ FIFA 20 for the PlayStation 4 and Xbox One brings two sides of The World’s Game to life - the prestige of the professional stage and an all-new authentic street football experience in EA SPORTS VOLTA","creator":"EA Sports","release":"27/09/2019","platform":"XBOX ONE","genre":"Sport","ageRating":"3+","score":1}
{"id":2,"name":"FORZA HORIZON 4","description":"Accelerate through historic Britain as you become a Horizon Superstar collecting 450 cars from 100 licensed manufacturers in Forza Horizon 4. For the first time in the series, you can experience dynamic seasons in this shared open-world","creator":"Microsoft Studios","release":"02/10/2018","platform":"XBOX ONE","genre":"Racing","ageRating":"3+","score":9}
{"id":3,"name":"NBA 2K20","description":"NBA 2K has evolved into much more than a basketball simulation. 2K continues to redefine what’s possible in sports gaming with NBA 2K20, featuring best in class graphics & gameplay, ground breaking game modes, and unparalleled player control and customisation","creator":"EA Sports","release":"06/09/2019","platform":"XBOX ONE","genre":"Sport","ageRating":"3+","score":8}
{"id":4,"name":"MINECRAFT - XBOX ONE EDITION","description":"The infinite possibilities in Minecraft just got bigger as Minecraft: Xbox One Edition brings the global phenomenon to console gamers for the first time","creator":"Microsoft","release":"28/11/2014","platform":"XBOX ONE","genre":"Action/Adventure","ageRating":"3+","score":4}
{"id":5,"name":"WWE 2K16","description":"Explore the biggest roster in WWE video game history! Raise Some Hell as your favourite WWE Superstars, Divas, Legends and more. Relive iconic WWE moments from the unparalleled career of Stone Cold Steve Austin in his story-driven 2K3:16 Showcase","creator":"2K Sports","release":"30/10/2015","platform":"XBOX ONE","genre":"Sport","ageRating":"16+","score":5}
{"id":6,"name":"STAR WARS: BATTLEFRONT II","description":"Rush through waves of enemies on Starkiller Base with the power of your lightsaber in your hands. Storm through the jungle canopy of a hidden Rebel base on Yavin 4 with your fellow troopers, dispensing firepower from AT-STs","creator":"EA Sports","release":"17/11/2017","platform":"XBOX ONE","genre":"Shooter","ageRating":"16+","score":7}
{"id":7,"name":"OVERWATCH","description":"The world needs heroes. Join over 30 million players* as you clash on the battlefields of tomorrow. Choose your hero from a diverse cast of soldiers, scientists, adventurers, and oddities","creator":"Blizzard","release":"28/07/2017","platform":"XBOX ONE","genre":"Shooter","ageRating":"12+","score":10}
{"id":8,"name":"ROCKET LEAGUE","description":"Take control of your own high-flying, hard-hitting, rocket-powered Battle-Car in the critically-acclaimed, futuristic Sports-Action hit, Rocket League: Collector's Edition!","creator":"Psyonix","release":"24/06/2016","platform":"XBOX ONE","genre":"Sport","ageRating":"3+","score":7}
{"id":9,"name":"MADDEN NFL 25","description":" You Like - American Football. Powered by EA Sports all-new Ignite engine, Madden 25 will deliver more realistic bone crunching tackles in stadiums that will explode with the roar, or boos, of the crowd when you score that Touchdown","creator":"EA Sports","release":"22/11/2013","platform":"XBOX ONE","genre":"Sport","ageRating":"3+","score":7}
{"id":10,"name":"TITANFALL","description":"Crafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall is an all-new universe juxtaposing small vs. giant, natural vs. industrial and man vs. machine","creator":"EA Sports","release":"14/03/2014","platform":"XBOX ONE","genre":"Shooter","ageRating":"16+","score":9}
