{"id":1,"review":"This game hasn't changed since 2017! Just a few more modes but the core gameplay is still the worst out there. The demo plays like a carbon copy of the recent iterations. EA takes easy money for just a minor update, and this year after year. If you like something else, try PES for once. If you are afraid of the lack of licenses, within 10 minutes you have all the licenses, kits and transfers. The people of PES world and PES Universe make those kits 100% original!","link1":"https://www.metacritic.com/game/switch/fifa-20-legacy-edition","link2":"https://www.gamespot.com/games/fifa-20/","link3":"https://www.ign.com/games/fifa-20"}
{"id":2,"review":"Playground Games has managed to deliver the best arcade games over the last decade and with Forza Horizon 4 proves it once again. It's a must for all Xbox One owners","link1":"https://www.metacritic.com/game/xbox-one/forza-horizon-4","link2":"https://www.gamespot.com/games/forza-horizon-4/","link3":"https://www.ign.com/articles/2018/09/25/forza-horizon-4-review"}
{"id":3,"review":"This is sad. The parks are the exact same as nba 2k19, but re-skinned. Feel like 2K put no effort in this game. The dribbling is clunky, the game speed is so slow, and there are bugs and glitches on top of each other with badges and rep. Don’t waste your money on this game!","link1":"https://www.metacritic.com/game/switch/nba-2k20","link2":"https://www.gamespot.com/games/nba-2k20/","link3":"https://www.ign.com/games/nba-2k20"}
{"id":4,"review":"ighly underrated game. I understand its kind of a meme to hate this game, but dont be an idiot. Give the game a chance. Look at it from diffrent angles and form your own opinion","link1":"https://www.metacritic.com/game/xbox-one/minecraft-xbox-one-edition","link2":"https://www.gamespot.com/games/minecraft/","link3":"https://www.ign.com/games/minecraft"}
{"id":5,"review":"With plenty of characters and modes to try out there could have been a lot to love here. Enjoying the game though requires getting past it's fighting system. Something that's unfortunately lacking here","link1":"https://www.metacritic.com/game/xbox-one/wwe-2k16","link2":"https://www.gamespot.com/games/wwe-2k16/","link3":"https://www.ign.com/games/wwe-2k16"}
{"id":6,"review":"Feels greatly improved from the first current-gen instalment. The single player was enjoyable even though the missions felt fairly similar just held in different environments","link1":"https://www.metacritic.com/game/xbox-one/star-wars-battlefront-ii","link2":"https://www.gamespot.com/games/star-wars-battlefront-ii/","link3":"https://www.ign.com/articles/2005/11/03/star-wars-battlefront-ii"}
{"id":7,"review":"The game defies the norm of pay to win games and instead offers fictional skins in a loot box RNG (Random Number Game) which can either be earned easily through levelling up through gameplay or payed through through Overwatches fictional currency","link1":"https://www.metacritic.com/game/xbox-one/overwatch","link2":"https://www.gamespot.com/games/overwatch/","link3":"https://www.ign.com/games/overwatch"}
{"id":8,"review":"Brilliant game combining driving and futuristic football - kids really liked it, especially playing with adults at Christmas. Takes time to get used to the controls and can be frustrating to pick up if you're an adult and a bit rubbish at games in general (like me)","link1":"https://www.metacritic.com/game/xbox-one/rocket-league","link2":"https://www.gamespot.com/games/rocket-league/","link3":"https://www.ign.com/games/rocket-league"}
{"id":9,"review":"Madden NFL 25 is the best American football game on the market. Mainly because it's the one and only. Even with this series EA seems to have fallen asleep, focusing more on the reaffirmation of the good aspects of the past rather than the introduction of something new","link1":"https://www.metacritic.com/game/xbox-one/madden-nfl-25","link2":"https://www.gamespot.com/games/madden-nfl-25/","link3":"https://www.ign.com/videos/2013/08/23/madden-nfl-25-review"}
{"id":10,"review":"Fun and a refreshing change to some of the normal shooters. Shame there is no single player story mode, however most of my time is playing online so no biggie really. Great game for all night sessions or just for a quick couple of games","link1":"https://www.metacritic.com/game/xbox-one/titanfall","link2":"https://www.gamespot.com/games/titanfall/","link3":"https://www.ign.com/search?q=TITANFALL"}

